import type { Consonants, Vowels } from './char.js';

export const toKana: Record<`${Consonants | ''}${Vowels | ''}`, string> = {
	'': '',
	_: '',
	a: 'ァ',
	i: 'ィ',
	u: 'ュ',
	e: 'ェ',
	o: 'ォ',
	_a: 'ア',
	_i: 'イ',
	_u: 'ウ',
	_e: 'エ',
	_o: 'オ',
	y: 'ィ',
	ya: 'ヤ',
	yi: 'ユィ',
	yu: 'ユ',
	ye: 'イェ',
	yo: 'ヨ',
	w: 'ゥ',
	wa: 'ワ',
	wi: 'ウィ',
	wu: 'ウ',
	we: 'ウェ',
	wo: 'ウォ',

	k: 'ク',
	ka: 'カ',
	ki: 'キ',
	ku: 'ク',
	ke: 'ケ',
	ko: 'コ',
	s: 'ス',
	sa: 'サ',
	si: 'スィ',
	su: 'ス',
	se: 'セ',
	so: 'ソ',
	t: 'ト',
	ta: 'タ',
	ti: 'ティ',
	tu: 'トゥ',
	te: 'テ',
	to: 'ト',
	p: 'プ',
	pa: 'パ',
	pi: 'ピ',
	pu: 'プ',
	pe: 'ペ',
	po: 'ポ',
	f: 'フ',
	fa: 'ファ',
	fi: 'フィ',
	fu: 'フ',
	fe: 'フェ',
	fo: 'フォ',

	g: 'グ',
	ga: 'ガ',
	gi: 'ギ',
	gu: 'グ',
	ge: 'ゲ',
	go: 'ゴ',
	z: 'ズ',
	za: 'ザ',
	zi: 'ズィ',
	zu: 'ズ',
	ze: 'ゼ',
	zo: 'ゾ',
	d: 'ド',
	da: 'ダ',
	di: 'ディ',
	du: 'ドゥ',
	de: 'デ',
	do: 'ド',
	b: 'ブ',
	ba: 'バ',
	bi: 'ビ',
	bu: 'ブ',
	be: 'ベ',
	bo: 'ボ',
	v: 'ヴ',
	va: 'ヴァ',
	vi: 'ヴィ',
	vu: 'ヴ',
	ve: 'ヴェ',
	vo: 'ヴォ',

	K: 'クィ', // ky
	Ka: 'キャ',
	Ki: 'クィ',
	Ku: 'キュ',
	Ke: 'キェ',
	Ko: 'キョ',
	c: 'チ', // ch
	ca: 'チャ',
	ci: 'チ',
	cu: 'チュ',
	ce: 'チェ',
	co: 'チョ',

	S: 'シュ', // sh
	Sa: 'シャ',
	Si: 'シ',
	Su: 'スュ',
	Se: 'シェ',
	So: 'ショ',
	T: 'トィ', // th
	Ta: 'テャ',
	Ti: 'トィ',
	Tu: 'テュ',
	Te: 'テェ',
	To: 'テョ',
	P: 'プィ', // py
	Pa: 'ピャ',
	Pi: 'プィ',
	Pu: 'ピュ',
	Pe: 'ピェ',
	Po: 'ピョ',
	F: 'フュ', // fy
	Fa: 'フャ',
	Fi: 'フィ',
	Fu: 'フュ',
	Fe: 'フェ',
	Fo: 'フョ',

	G: 'グィ', // gy
	Ga: 'ギャ',
	Gi: 'グィ',
	Gu: 'ギュ',
	Ge: 'ギェ',
	Go: 'ギョ',

	j: 'ジュ',
	ja: 'ジャ',
	ji: 'ジ',
	ju: 'ジュ',
	je: 'ジェ',
	jo: 'ジョ',
	Z: 'ジュ', // j
	Za: 'ジャ',
	Zi: 'ジ',
	Zu: 'ジュ',
	Ze: 'ジェ',
	Zo: 'ジョ',

	D: 'デュ', // dhドィ
	Da: 'デャ',
	Di: 'ディ',
	Du: 'デュ',
	De: 'デェ',
	Do: 'デョ',
	B: 'ブィ', // by
	Ba: 'ビャ',
	Bi: 'ブィ',
	Bu: 'ビュ',
	Be: 'ビェ',
	Bo: 'ビョ',
	V: 'ヴィ', // vy
	Va: 'ヴャ',
	Vi: 'ヴィ',
	Vu: 'ヴュ',
	Ve: 'ヴェ',
	Vo: 'ヴョ',

	h: 'フ',
	ha: 'ハ',
	hi: 'ヒ',
	hu: 'フ',
	he: 'ヘ',
	ho: 'ホ',
	H: 'ヒュ', // hy
	Ha: 'ヒャ',
	Hi: 'ヒィ',
	Hu: 'ヒュ',
	He: 'ヒェ',
	Ho: 'ヒョ',

	x: 'ツ', // ts
	xa: 'ツァ',
	xi: 'ツィ',
	xu: 'ツ',
	xe: 'ツェ',
	xo: 'ツォ',

	n: 'ン',
	na: 'ナ',
	ni: 'ニ',
	nu: 'ヌ',
	ne: 'ネ',
	no: 'ノ',
	N: 'ヌィ', // ny
	Na: 'ニャ',
	Ni: 'ヌィ',
	Nu: 'ニュ',
	Ne: 'ニェ',
	No: 'ニョ',
	m: 'ム',
	ma: 'マ',
	mi: 'ミ',
	mu: 'ム',
	me: 'メ',
	mo: 'モ',
	M: 'ムィ', // my
	Ma: 'ミャ',
	Mi: 'ムィ',
	Mu: 'ミュ',
	Me: 'ミェ',
	Mo: 'ミョ',

	l: 'ル',
	la: 'ラ',
	li: 'リ',
	lu: 'ル',
	le: 'レ',
	lo: 'ロ',
	r: 'ル',
	ra: 'ラ',
	ri: 'リ',
	ru: 'ル',
	re: 'レ',
	ro: 'ロ',
	R: 'リュ', //ry、rh
	Ra: 'リャ',
	Ri: 'ルィ',
	Ru: 'リュ',
	Re: 'リェ',
	Ro: 'リョ',
};

// export const toKana2: Record<Consonants, string[]> = {
// 	_: ['ア', 'イ', 'ウ', 'エ', 'オ', ''],
// 	y: ['ヤ', 'イ', 'ユ', 'イェ', 'ヨ', 'ィ'],
// 	w: ['ワ', 'ウィ', 'ウ', 'ウェ', 'ウォ', 'ウ'],

// 	k: ['カ', 'キ', 'ク', 'ケ', 'コ', 'ク'],
// 	s: ['サ', 'スィ', 'ス', 'セ', 'ソ', 'ス'],
// 	t: ['タ', 'ティ', 'トゥ', 'テ', 'ト', 'ト'],
// 	p: ['パ', 'ピ', 'プ', 'ペ', 'ポ', 'プ'],
// 	f: ['ファ', 'フィ', 'フ', 'フェ', 'フォ', 'フ'],

// 	g: ['ガ', 'ギ', 'グ', 'ゲ', 'ゴ', 'グ'],
// 	z: ['ザ', 'ズィ', 'ズ', 'ゼ', 'ゾ', 'ズ'],
// 	d: ['ダ', 'ディ', 'ドゥ', 'デ', 'ド', 'ド'],
// 	b: ['バ', 'ビ', 'ブ', 'ベ', 'ボ', 'ブ'],
// 	v: ['ヴァ', 'ヴィ', 'ヴ', 'ヴェ', 'ヴォ', 'ヴ'],

// 	K: ['キャ', 'クィ', 'キュ', 'キェ', 'キョ', 'クィ'], // ky
// 	c: ['チャ', 'チ', 'チュ', 'チェ', 'チョ', 'チ'], // ch

// 	S: ['シャ', 'シ', 'シュ', 'シェ', 'ショ', 'シュ'], // sh
// 	T: ['テャ', 'トィ', 'テュ', 'テェ', 'テョ', 'トィ'], // th
// 	P: ['ピャ', 'プィ', 'ピュ', 'ピェ', 'ピョ', 'プィ'], // py
// 	F: ['フャ', 'フィ', 'フュ', 'フェ', 'フョ', 'フュ'],

// 	G: ['ギャ', 'グィ', 'ギュ', 'ギェ', 'ギョ', 'グィ'], // gy

// 	Z: ['ジャ', 'ジ', 'ジュ', 'ジェ', 'ジョ', 'ジュ'],
// 	j: ['ジャ', 'ジ', 'ジュ', 'ジェ', 'ジョ', 'ジュ'],

// 	D: ['デャ', 'ディ', 'デュ', 'デェ', 'デョ', 'デュ'], // dh
// 	B: ['ビャ', 'ブィ', 'ビュ', 'ビェ', 'ビョ', 'ビュ'], // by
// 	V: ['ヴャ', 'ヴィ', 'ヴュ', 'ヴェ', 'ヴョ', 'ヴュ'],

// 	h: ['ハ', 'ヒ', 'フ', 'ヘ', 'ホ', 'フ'],
// 	H: ['ヒャ', 'ヒィ', 'ヒュ', 'ヒェ', 'ヒョ', 'ヒュ'], // hy

// 	x: ['ツァ', 'ツィ', 'ツ', 'ツェ', 'ツォ', 'ツ'], // ts

// 	n: ['ナ', 'ニ', 'ヌ', 'ネ', 'ノ', 'ン'],
// 	N: ['ニャ', 'ヌィ', 'ニュ', 'ニェ', 'ニョ', 'ヌィ'], // ny
// 	m: ['マ', 'ミ', 'ム', 'メ', 'モ', 'ム'],
// 	M: ['ミャ', 'ムィ', 'ミュ', 'ミェ', 'ミョ', 'ムィ'], // my

// 	r: ['ラ', 'リ', 'ル', 'レ', 'ロ', 'ー'],
// 	l: ['ラ', 'リ', 'ル', 'レ', 'ロ', 'ル'],
// 	R: ['リャ', 'ルィ', 'リュ', 'リェ', 'リョ', 'リュ'], //ry、rh
// };

export const fromKana = Object.entries(toKana).reduce(
	(obj, v) => {
		const [key, char] = v;
		obj[char] ??= key;
		return obj;
	},
	{
		ヮ: 'a',
		ドィ: 'Di',
		ラュ: 'Ru',
		マュ: 'Mu',
		ダュ: 'Du',
		ブュ: 'Bu',
	},
);
